app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]
---
<h5>Comments:</h5>
<% @post.comments.each do |comment| %>