app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "slug") VALUES (?, ?)  [["name", "News"], ["slug", "News"]]
---
  def create
    @category = Category.new(params.require(:category).permit(:name))
    if @category.save