app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'Code' LIMIT 1
---
  def show
    #@category = Category.find(params[:id])
    @category = Category.find_by(slug: params[:id])