app/controllers/comments_controller.rb

  def create
    @post = Post.find_by(slug: params[:post_id])
    @comment = Comment.new(params.require(:comment).permit(:body))
    @comment.post = @post
    #@comment = @post.comments.build(params.require(:comment).permit(:body))
    @comment.creator = User.find(session[:user_id])
    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'hi-tehre-a;rlkj' LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 10]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "test"], ["created_at", Tue, 14 Nov 2017 07:29:26 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 14 Nov 2017 07:29:26 UTC +00:00], ["user_id", 1]]

  def vote
    @comment = Comment.find(params[:id])
    vote = Vote.create(voteable: Comment.find(params[:id]), creator: current_user, vote: params[:vote])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 20 Nov 2017 04:00:20 UTC +00:00], ["updated_at", Mon, 20 Nov 2017 04:00:20 UTC +00:00], ["user_id", 5], ["vote", true], ["voteable_id", 7], ["voteable_type", "Comment"]]