app/controllers/comments_controller.rb

  def vote
    vote = Vote.create(voteable: Comment.find(params[:id]), creator: current_user, vote: params[:vote])
    if vote.errors.any?
---
SELECT 1 AS one FROM "votes" WHERE ("votes"."user_id" = 5 AND "votes"."voteable_id" = 7) LIMIT 1