app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{|x| x.total_votes}.reverse
---
SELECT "posts".* FROM "posts"

  def show
    @comment = Comment.new
    respond_to do |format|
      format.html
      format.json do
        comment_list = []
        @post.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]

  def create
    @post = Post.new(post_params)
    @post.creator = User.find(session[:user_id])

    if @post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "posts" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Tue, 14 Nov 2017 01:47:00 UTC +00:00], ["title", "Some TItle"], ["updated_at", Tue, 14 Nov 2017 01:47:00 UTC +00:00], ["url", "A URL here"]]

  def update
    @post.update(post_params)
    if @post.save
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 5  [["description", "Hello world!"], ["updated_at", Tue, 14 Nov 2017 02:11:44 UTC +00:00]]
INSERT INTO "posts" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Tue, 14 Nov 2017 01:52:06 UTC +00:00], ["title", "Some TItle2"], ["updated_at", Tue, 14 Nov 2017 01:52:06 UTC +00:00], ["url", "A URL here"]]

  def vote
    vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 20 Nov 2017 02:15:16 UTC +00:00], ["updated_at", Mon, 20 Nov 2017 02:15:16 UTC +00:00], ["user_id", 5], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]

    def set_post
      #@post = Post.find(params[:id])
      @post = Post.find_by(slug: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'hi-tehre-a;rlkj' LIMIT 1