app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Thu, 16 Nov 2017 03:53:28 UTC +00:00], ["updated_at", Thu, 16 Nov 2017 03:53:28 UTC +00:00], ["username", ""]]
---
  def create
    @user = User.new(params.require(:user).permit(:username, :password))
    if @user.save

UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["username", "test"], ["password_digest", "$2a$10$YDr8jRWo.5IVAWtcqlFvr.dcPKRyBvFLe2cwfcNU5/8kkaQZMSWQq"], ["updated_at", Thu, 16 Nov 2017 06:19:32 UTC +00:00]]
---
  def update
    @user.update(params.require(:user).permit(:username, :password))