app/views/layouts/_navigation.html.erb

SELECT "categories".* FROM "categories"
---
  <ul class='dropdown-menu'>
    <% Category.all.each do |category| %>